In [83]:
from sqlalchemy import create_engine, text
import pandas as pd
from datetime import datetime


connection_string = "mssql+pyodbc://Admin:admin1234@LAPTOP-B5O30HDH\SQLEXPRESS/bestbuyStagingAreadb?driver=ODBC+Driver+17+for+SQL+Server"

# Create the SQLAlchemy Engine
engine = create_engine(connection_string)

dateNow = datetime.now().date()
year = 2023#dateNow.year
month = dateNow.month

month_mapping = {
    'janv': '01',
    'févr': '02',
    'mars': '03',
    'avr': '04',
    'mai': '05',
    'juin': '06',
    'juil': '07',
    'août': '08',
    'sept': '09',
    'oct': '10',
    'nov': '11',
    'déc': '12'
}

with engine.connect() as conn:
    #SQlServer Data
    result = conn.execute(text(f"select * from sales where YEAR(saleDate) = '{year}' and MONTH(saleDate) = '{month}'"))
    columns = result.keys() # Extract column names
    sql_df = pd.DataFrame(result.fetchall(), columns=columns)
    #Transformation date "mai 16 2023 11:54AM"
    # Replace the French month name with the numerical representation
    sql_df['saleDate'] =  sql_df['saleDate'].replace(month_mapping,regex=True)
    #sql_df['saleDate'] = pd.to_datetime(sql_df['saleDate'].replace(month_mapping, regex=True), format='%b %d %Y %I:%M%p', errors='coerce')

    #CSV Data
    csv_df = pd.read_csv('../resources/sales.csv', low_memory=False)
    csv_df['saleDate'] = pd.to_datetime(csv_df['saleDate'])
    csv_df = csv_df[csv_df['saleDate'].dt.strftime('%Y-%m') == f'{year}-{month if month > 9 else "0"+str(month)}']

    #Json Data
    json_df = pd.read_json('../resources/sales.json')
    json_df['saleDate'] = pd.to_datetime(json_df['saleDate'], unit='ms')
    json_df = json_df[json_df['saleDate'].dt.strftime('%Y-%m') == f'{year}-{month if month > 9 else "0"+str(month)}']

    #data concatenation
    sales_data = pd.concat([sql_df,csv_df,json_df])

    print(len(csv_df),'+',len(json_df),'+',len(sql_df),'=',len(sales_data))

23803 + 23830 + 65477 = 113110

In [357]:
connection_string = "mssql+pyodbc://Admin:admin1234@192.168.56.1/bestbuyStagingAreadb?driver=ODBC+Driver+17+for+SQL+Server"

# Create the SQLAlchemy Engine
engine = create_engine(connection_string)
with engine.connect() as conn:
    result = conn.execute(text(f"select TOP 1 * from sales where YEAR(saleDate) = '{year}' and MONTH(saleDate) = '{month}'"))
    columns = result.keys()
    print(list(columns)[0])

id

In [88]:
sales_data.shape

(113110, 39)

# Convert 'startDate' and 'saleDate' columns to datetime format

In [89]:
sales_data['saleDate'] = pd.to_datetime(sales_data['saleDate'], errors='coerce')

In [90]:
sales_data['saleDate'].head()

0   2023-01-28 03:36:00
1   2023-01-01 06:18:00
2   2023-01-24 04:51:00
3   2023-01-16 09:44:00
4   2023-01-02 07:14:00
Name: saleDate, dtype: datetime64[ns]

# Drop duplicate rows

In [91]:
sales_data.drop_duplicates(inplace=True)

# Create a new column 'discount' representing the discount percentage

In [92]:
sales_data['discount'] = ((sales_data['regularPrice'].astype(float) - sales_data['salePrice'].astype(float)) / sales_data['regularPrice'].astype(float)) * 100

In [93]:
# Replace missing values in 'customerReviewCount' with 0
sales_data['customerReviewCount'] = sales_data['customerReviewCount'].fillna(0)

In [94]:
# Convert 'customerAge' to numeric and handle missing values
sales_data['customerAge'] = pd.to_numeric(sales_data['customerAge'], errors='coerce')

In [95]:
# Convert 'customerGender' to lowercase for consistency
sales_data['customerGender'] = sales_data['customerGender'].str.lower()

In [96]:
# Remove leading and trailing whitespaces in 'customerName'
sales_data['customerName'] = sales_data['customerName'].str.strip()

In [97]:
# Filter out rows where 'quantitySold' is less than or equal to 0
sales_data = sales_data[sales_data['quantitySold'] > 0]

In [220]:
df_type = pd.DataFrame(sales_data['type'].unique()).rename(columns={0:'type'})
df_type.insert(0,"typeID",[id for id in range(1,len(df_type['type'])+1)])
df_type

   typeID      type
0       1     Movie
1       2  BlackTie
2       3  HardGood
3       4     Music
4       5      Game

In [136]:
sales_data['format'].fillna('NoFormat',inplace=True)

In [221]:
#sales_data['format'].unique()
df_format = pd.DataFrame(sales_data['format'].unique()).rename(columns={0:'format'})
df_format.insert(0,"formatID",[id for id in range(1,len(df_format['format'])+1)])
df_format

    formatID                format
0          1               Blu-ray
1          2                   DVD
2          3              NoFormat
3          4          Blu-Ray Disc
4          5                 VINYL
5          6              CD & DVD
6          7                    CD
7          8               Digital
8          9  12 inch Vinyl Single
9         10           12In Single
10        11        12-Inch Single
11        12            10 inch LP
12        13  Extended Play Record

In [222]:
df_class = pd.DataFrame(sales_data['class'].unique()).rename(columns={0:'class'})
df_class.insert(0,"classID",[id for id in range(1,len(df_class['class'])+1)])
df_class

    classID                 class
0         1        BLU RAY MOVIES
1         2          DVD SOFTWARE
2         3   MAJOR APPLIANCE GSP
3         4     CAR INSTALL PARTS
4         5  MOBILE COMP. ACCESS.
..      ...                   ...
60       61         CAMERAS - ILC
61       62  COMPUTER ACCESSORIES
62       63  PEDESTALS & STACKING
63       64   SO OFFICE FURNITURE
64       65               GUITARS

[65 rows x 2 columns]

In [223]:
df_subclass = pd.DataFrame(sales_data['subclass'].unique()).rename(columns={0:'subclass'})
df_subclass.insert(0,"subclassID",[id for id in range(1,len(df_subclass['subclass'])+1)])
df_subclass

     subclassID             subclass
0             1            CHILDRENS
1             2               TV-A-Z
2             3               ACTION
3             4          BLU RAY A-Z
4             5           BLU RAY TV
..          ...                  ...
168         169         SO BATTERIES
169         170  SO ACOUSTIC GUITARS
170         171      SO NOVELTY APPL
171         172     SO BOOKCS&ENDTAB
172         173          SO OTTOMANS

[173 rows x 2 columns]

In [224]:
df_department =  pd.DataFrame(sales_data['department'].unique()).rename(columns={0:'department'})
df_department.insert(0,'departmentID',[id for id in range(1,len(df_department['department'])+1)])
df_department

    departmentID            department
0              1    VIDEO/COMPACT DISC
1              2              WARRANTY
2              3          MOBILE AUDIO
3              4     PHOTO/COMMODITIES
4              5             COMPUTERS
5              6             APPLIANCE
6              7                 AUDIO
7              8  INTERACTIVE SOFTWARE
8              9  MAGNOLIA HOME THEATR
9             10                 VIDEO
10            11           ACCESSORIES
11            12                   DTS

In [225]:
sales_data['genre'].fillna('NoGenre',inplace=True)

In [226]:
df_genre = pd.DataFrame(sales_data['genre'].unique()).rename(columns={0:'genre'})
df_genre.insert(0,'genreID',[id for id in range(1,len(df_genre['genre'])+1)])
df_genre

    genreID                 genre
0         1  Action and Adventure
1         2               NoGenre
2         3                 Drama
3         4  Childrens and Family
4         5                Action
..      ...                   ...
75       76           Blues Music
76       77           Documentary
77       78                 Latin
78       79            Jazz Music
79       80         Country Music

[80 rows x 2 columns]

In [227]:
df_payment = pd.DataFrame(sales_data['paymentMethod'].unique()).rename(columns={0:'paymentMethod'})
df_payment.insert(0,'paymentMethodID',[id for id in range(1,len(df_payment['paymentMethod'])+1)])
df_payment

   paymentMethodID paymentMethod
0                1     Apple Pay
1                2   Debit cards
2                3  Credit cards
3                4        Paypal
4                5    Google Pay
5                6    Amazon Pay

In [251]:
#customer dimension
df_customers = sales_data[['customerName', 'customerAge', 'customerGender', 'customuerEmail','customerCountry']].drop_duplicates()
df_customers.insert(0,'customerID',[id for id in range(1,len(df_customers)+1)])

df_customers.head()

,customerID,customerName,customerAge,customerGender,customuerEmail,customerCountry
0,1,Sara Jones,36,male,tmckinney@example.org,Norway
1,2,James Ortega,48,female,saralopez@example.com,Russian Federation
2,3,Diana Smith,18,male,keith96@example.net,Ethiopia
3,4,Kimberly Delacruz,18,male,maria99@example.net,Isle of Man
4,5,Corey Lopez,40,female,jessica58@example.net,Guinea-Bissau

In [247]:
#customer dimension
df_products = sales_data[['sku','name','startDate','new','active','activeUpdateDate','priceUpdateDate',
    'digital', 'preowned','url', 'productTemplate','freeShipping','specialOrder',
        'mpaaRating','image','shortDescription','condition','customerTopRated','customerReviewCount','customerReviewAverage','type','format','class','subclass','department','genre']].drop_duplicates()


df_products = pd.merge(df_products,df_type,on=['type'],how='left')
df_products = pd.merge(df_products,df_format,on=['format'],how='left')
df_products = pd.merge(df_products,df_class,on=['class'],how='left')
df_products = pd.merge(df_products,df_subclass,on=['subclass'],how='left')
df_products = pd.merge(df_products,df_department,on=['department'],how='left')
df_products = pd.merge(df_products,df_genre,on=['genre'],how='left')

df_products.drop(['type','format','class','subclass','department','genre'], axis=1, inplace=True)

df_products.head()

,sku,name,startDate,new,active,activeUpdateDate,priceUpdateDate,digital,preowned,url,...,condition,customerTopRated,customerReviewCount,customerReviewAverage,typeID,formatID,classID,subclassID,departmentID,genreID
0,1000006,Spy Kids: All the Time in the World [Includes ...,2011-04-26,0,1,2020-02-29T03:42:41,2023-01-25T00:02:01,0,0,https://api.bestbuy.com/click/-/1000006/pdp,...,New,1,77,4.5,1,1,1,1,1,1
1,1000592,The Mentalist: The Complete Fifth Season [5 Di...,2013-02-19,0,1,2020-02-28T16:55:43,2024-01-05T00:02:39,0,0,https://api.bestbuy.com/click/-/1000592/pdp,...,New,1,58,4.7,1,2,2,2,1,2
2,1001149,Rambo [Extended Cut] [Blu-ray] [2008],2009-12-29,0,1,2023-01-14T05:15:53,2023-03-04T00:01:16,0,0,https://api.bestbuy.com/click/-/1001149/pdp,...,New,1,551,4.6,1,1,1,3,1,1
3,1001176,Johnny Handsome [Blu-ray] [1989],2009-12-29,0,1,2020-02-29T02:52:03,2023-02-10T00:02:49,0,0,https://api.bestbuy.com/click/-/1001176/pdp,...,New,None,0,None,1,1,1,4,1,3
4,1004613,Life (Narrated By David Attenborough) [4 Discs...,2009-11-03,0,1,2023-09-30T05:45:44,2023-02-04T05:38:41,0,0,https://api.bestbuy.com/click/-/1004613/pdp,...,New,1,328,4.9,1,1,1,5,1,2

In [266]:
#date dimension
df_date = sales_data[['saleDate']].drop_duplicates()

df_date.insert(0,'dateID',[id for id in range(1,len(df_date)+1)])
df_date.insert(2,'year',df_date['saleDate'].dt.year)
df_date.insert(3,'month',df_date['saleDate'].dt.month)
df_date.insert(4,'day',df_date['saleDate'].dt.day)
df_date.insert(5,'hour',df_date['saleDate'].dt.hour)
df_date.insert(6,'minute',df_date['saleDate'].dt.minute)

df_date

        dateID            saleDate  year  month  day  hour  minute
0            1 2023-01-28 03:36:00  2023      1   28     3      36
1            2 2023-01-01 06:18:00  2023      1    1     6      18
2            3 2023-01-24 04:51:00  2023      1   24     4      51
3            4 2023-01-16 09:44:00  2023      1   16     9      44
4            5 2023-01-02 07:14:00  2023      1    2     7      14
...        ...                 ...   ...    ...  ...   ...     ...
268941   22170 2023-01-15 03:46:00  2023      1   15     3      46
272417   22171 2023-01-03 01:27:00  2023      1    3     1      27
274350   22172 2023-01-13 08:27:00  2023      1   13     8      27
276109   22173 2023-01-20 08:24:00  2023      1   20     8      24
279208   22174 2023-01-15 12:34:00  2023      1   15    12      34

[22174 rows x 7 columns]

In [269]:
#sales fact
df_sales = sales_data[['sku','regularPrice', 'salePrice','shippingCost','customerName', 'customerAge', 'customerGender', 'customuerEmail',
       'customerCountry', 'saleDate', 'quantitySold', 'paymentMethod',
       'totalPrice', 'discount']]

df_sales.insert(0,'id',[id for id in range(1,len(df_sales)+1)])

df_sales = pd.merge(df_sales,df_customers,on=['customerName', 'customerAge', 'customerGender', 'customuerEmail','customerCountry'],how='left')
df_sales = pd.merge(df_sales,df_payment,on=['paymentMethod'],how='left')
df_sales = pd.merge(df_sales,df_date,on=['saleDate'],how='left')

df_sales.drop(['customerName', 'customerAge', 'customerGender', 'customuerEmail','customerCountry','paymentMethod'],axis=1,inplace=True)
df_sales.drop(['saleDate', 'year', 'month', 'day','hour','minute'], axis=1,inplace=True)

df_sales.head()

,id,sku,regularPrice,salePrice,shippingCost,quantitySold,totalPrice,discount,customerID,paymentMethodID,dateID
0,1,1000006,14.99,14.99,4.99,7,104.93,0.0,1,1,1
1,2,1000006,14.99,14.99,4.99,8,119.92,0.0,2,2,2
2,3,1000006,14.99,14.99,4.99,15,224.85,0.0,3,3,3
3,4,1000006,14.99,14.99,4.99,9,134.91,0.0,4,4,4
4,5,1000006,14.99,14.99,4.99,3,44.97,0.0,5,3,5

In [309]:
df_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   typeID  5 non-null      int64
 1   type    5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [343]:
df_sales.columns

Index(['id', 'sku', 'regularPrice', 'salePrice', 'shippingCost',
       'quantitySold', 'totalPrice', 'discount', 'customerID',
       'paymentMethodID', 'dateID'],
      dtype='object')

In [344]:
connection_string_insertion = "mssql+pyodbc://Admin:admin1234@LAPTOP-B5O30HDH\SQLEXPRESS/bestbuyDataWarehouse?driver=ODBC+Driver+17+for+SQL+Server"
engine_dw = create_engine(connection_string_insertion)

# Create and save dimension tables to SQL Server
dimension_tables = {
    'dim_type':df_type,
    'dim_format':df_format,
    'dim_class':df_class,
    'dim_subclass':df_subclass,
    'dim_department':df_department,
    'dim_genre':df_genre,
    #
    'dim_products':df_products,
    #
    'dim_customers':df_customers,
    #
    'dim_date':df_date,
    #
    'dim_paymentMethod':df_payment,
}

# try:
#     df_type.to_sql('dim_type', con=engine_dw, if_exists='append', index=False)
# except :
#     pass

# Save dimension tables to SQL Server
for table_name, table_df in dimension_tables.items():
    try:
        table_df.to_sql(table_name, con=engine_dw, if_exists='append', index=False)
    except:
        pass

#Fact table
fact_table_name = 'fact_sales'
try:
    df_sales.to_sql(fact_table_name, con=connection_string_insertion, if_exists='replace', index=False)
except:
    pass

60

In [382]:
df_sales['sku'] = df_sales['sku'].astype(str)
df_sales['regularPrice'] = df_sales['regularPrice'].astype(float)
df_sales['salePrice'] = df_sales['salePrice'].astype(float)

#df_sales['shippingCost'].fillna(0,inplace=True)
df_sales['shippingCost'] = pd.to_numeric(df_sales['shippingCost'])
# df_sales['shippingCost'] = df_sales['shippingCost'].astype(float)

df_sales.info()

#df_sales[df_sales['shippingCost'] == 0]

<class 'pandas.core.frame.DataFrame'>
Int64Index: 113110 entries, 0 to 113109
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id               113110 non-null  int64
 1   sku              113110 non-null  object
 2   regularPrice     113110 non-null  float64
 3   salePrice        113110 non-null  float64
 4   shippingCost     113110 non-null  float64
 5   quantitySold     113110 non-null  int64
 6   totalPrice       113110 non-null  float64
 7   discount         113110 non-null  float64
 8   customerID       113110 non-null  int64
 9   paymentMethodID  113110 non-null  int64
 10  dateID           113110 non-null  int64
dtypes: float64(5), int64(5), object(1)
memory usage: 10.4+ MB

In [394]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4718 entries, 0 to 4717
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   sku                    4718 non-null   int64
 1   name                   4718 non-null   object
 2   startDate              4718 non-null   object
 3   new                    4718 non-null   object
 4   active                 4718 non-null   object
 5   activeUpdateDate       4718 non-null   object
 6   priceUpdateDate        4718 non-null   object
 7   digital                4718 non-null   object
 8   preowned               4718 non-null   object
 9   url                    4718 non-null   object
 10  productTemplate        4718 non-null   object
 11  freeShipping           4082 non-null   object
 12  specialOrder           4718 non-null   object
 13  mpaaRating             1885 non-null   object
 14  image                  4616 non-null   object
 15  shortDescription       455 non-null    object
 16  condition              4718 non-null   object
 17  customerTopRated       2117 non-null   object
 18  customerReviewCount    4718 non-null   object
 19  customerReviewAverage  2117 non-null   object
 20  typeID                 4718 non-null   int64
 21  formatID               4718 non-null   int64
 22  classID                4718 non-null   int64
 23  subclassID             4718 non-null   int64
 24  departmentID           4718 non-null   int64
 25  genreID                4718 non-null   int64
dtypes: int64(7), object(19)
memory usage: 995.2+ KB

In [428]:
#pip install cryptography

In [430]:
from cryptography.fernet import Fernet


# Generate a key for encryption (keep this key secure)
encryption_key = Fernet.generate_key()
cipher_suite = Fernet(encryption_key)

df_customers['customuerEmail'] = df_customers['customuerEmail'].apply(lambda x: cipher_suite.encrypt(x.encode('utf-8')).decode('utf-8'))
df_customers['customuerEmail']

0         gAAAAABlq_KHk5KqYOHSeMrK0iUpHpoTrwUvc7P3m6mo--...
1         gAAAAABlq_KHz_8HXGaagO4bHzuz3w_HqWMOADMGmvCGx9...
2         gAAAAABlq_KHaUSOQtx-pfyxQA1VEBdYaEzRM8TTD2T0e6...
3         gAAAAABlq_KHP_uZB4BixwF4ZN2rK6Gg4qgSsg9V0flxJO...
4         gAAAAABlq_KHqXt6mJJ_4khEub9MbHPivKpMPi-QHgDPKk...
                                ...
281797    gAAAAABlq_KRQjNTxAi-yixNtz9ykQz_A3KqnCZA6rQWyI...
281807    gAAAAABlq_KRqqueu6AQeAhosi8Ltky7eV2zyuUPKIF3f7...
281815    gAAAAABlq_KRPPmdUjVtU2b_eP3eKvq2ecCatjw3xgpG4z...
281816    gAAAAABlq_KRte-QC2XKMEpxvFDnB96JZqK26-cKpLL_sP...
281834    gAAAAABlq_KROOYdh6vGlqtcxNlxeb2g8M-NR0tyiLTA6-...
Name: customuerEmail, Length: 113110, dtype: object